---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewCurveLoopsProfile(Autodesk.Revit.DB.CurveArrArray)
source: html/b7534c0f-896d-14b1-f5fc-638caae5ec29.htm
---
# Autodesk.Revit.Creation.Application.NewCurveLoopsProfile Method

Creates a new CurveLoopsProfile object.

## Syntax (C#)
```csharp
public CurveLoopsProfile NewCurveLoopsProfile(
	CurveArrArray curveLoops
)
```

## Parameters
- **curveLoops** (`Autodesk.Revit.DB.CurveArrArray`) - The curve loops of the Profile.

## Returns
The new CurveLoopsProfile object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the argument is Nothing nullptr a null reference ( Nothing in Visual Basic) .